{"intents": [
        {"tag": "Cuts",
         "patterns": ["What to do if Cuts?", "How to cure Cuts?", "Which medicine to apply for Cuts?", "what to apply on cuts?", "Cuts"],
         "responses": ["Wash the cut properly to prevent infection and stop the bleeding by applying pressure for 1-2minutes until bleeding stops.\nApply Petroleum Jelly to make sure that the wound is moist for quick healing.\nFinally cover the cut with a sterile bandage.\nPain relievers such as acetaminophen can be applied."],
         "context": ""
        },

        {"tag": "Abrasions",
         "patterns": ["how do you treat abrasions?", "Do Abrasions cause scars?", "Abrasions", "what to do if abrasions?", "Which medicine to apply for abrasions?", "How to cure abrasions?"],
         "responses": ["Begin with washed hands. Gently clean the area with cool to lukewarm water and mild soap.\n Remove dirt or other particles from the wound using sterilized tweezers. \nFor a mild scrape that’s not bleeding, leave the wound uncovered. \n\nIf the wound is bleeding, use a clean cloth or bandage, and apply gentle pressure to the area to stop any bleeding. \nCover a wound that bled with a thin layer of topical antibiotic ointment, like Bacitracin, or a sterile moisture barrier ointment, like Aquaphor. \nCover it with a clean bandage or gauze. Gently clean the wound and change the ointment and bandage once per day.\nWatch the area for signs of infection, like pain or redness and swelling. See your doctor if you suspect infection."],
         "context": ""
        },

        {"tag": "stings",
         "patterns": ["How do you treat Sting?", "Stings", "What to do if you get a sting?", "Which medicine to apply if sting?"],
         "responses": ["Remove any stingers immediately. Some experts recommend scraping out the stinger with a credit card. \nApplying ice to the site may provide some mild relief. Apply ice for 20 minutes once every hour as needed. \nWrap the ice in a towel or keep a cloth between the ice and skin to keep from freezing the skin. \nTaking an antihistamine such as diphenhydramine (Benadryl) or a nonsedating one such as loratadine (Claritin) will help with itching and swelling. Take acetaminophen (Tylenol) or ibuprofen (Motrin)for pain relief as needed. \nWash the sting site with soap and water. \nPlacing hydrocortisone cream on the sting can help relieve redness, itching, and swelling."],
         "context": ""
        },

        {"tag": "Splinter",
         "patterns": ["How to remove Splinters", "How to cure Splinters?", "What to do if I have splinters?", "How do you bring a splinter to the surface?"],
         "responses": ["1. SOAK IT IN EPSOM SALTS. Dissolve a cup of the salts into a warm bath and soak whatever part of the body has the splinter. Failing that, you can also put some of the salts onto a bandage pad and leave it covered for a day; this will eventually help bring the splinter to the surface. \n2. VINEGAR OR OIL. Another simple way to draw out that stubborn splinter is to soak the affected area in oil (olive or corn) or white vinegar. Just pour some in a bowl and soak the area for around 20 to 30 minutes,"],
         "context": ""
        },

        {"tag": "Sprains",
         "patterns": ["How do you treat a sprain?", "what to do if i get a sprain?", "Which cream to apply if i get a sprain?", "Which medicine to apply if I get a sprain?"],
         "responses": ["Use an ice pack or ice slush bath immediately for 15 to 20 minutes and repeat every two to three hours while you're awake. \nTo help stop swelling, compress the ankle with an elastic bandage until the swelling stops. \nIn most cases, pain relievers — such as ibuprofen (Advil, Motrin IB, others) or naproxen sodium (Aleve, others) or acetaminophen (Tylenol, others) are enough to manage the pain of a sprained ankle."],
         "context": ""
        },

        {"tag": "Strains",
         "patterns": ["How do you treat a strain?", "what to do if i get a strain?", "Which cream to apply if i get a strain?", "Which medicine to apply if I get a strain?", "How do you diagnose a strain?", "Is heat or ice better for a pulled muscle?"],
         "responses": ["Rest,Ice,Compression and Elevation can be used to cure strains. \nAvoid using your muscle for a few days, especially if movement causes an increase in pain and also apply ice immediately after injuring your muscle. This will minimize swelling. \nDon’t put ice directly on your skin. Use an ice pack or wrap ice in a towel. \nTo reduce swelling, wrap the affected area with an elastic bandage until swelling comes down."],
         "context": ""
        },

        {"tag": "Fever",
         "patterns": ["How do you treat a mild Fever?", "what to do if i get a mild fever?", "Which medicine to take if I get a mild fever?", "fever"],
         "responses": ["To treat a fever at home: \n1)Drink plenty of fluids to stay hydrated. \n2)Dress in lightweight clothing. \n3)Use a light blanket if you feel chilled, until the chills end. \n4)Take acetaminophen (Tylenol, others) or ibuprofen (Advil, Motrin IB, others). \n5) Get medical help if the fever lasts more than five days in a row."],
         "context": ""
        },

        {"tag": "Nasal Congestion",
         "patterns": ["How do you treat nasal Congestion?", "what to do if i get a nasal congestion?", "Which medicine to take if I have a nasal congestion?", "what to do if i have a blocked nose?", "How do you treat a blocked nose?", "How long does nasal congestion last?"],
         "responses": ["When your nose feels stuffed up, focus on keeping your nasal passages and sinuses moist. To keep your nasal passages moist, you can:\n 1)Use a humidifier or vaporizer.\n 2)Drink lots of fluids. This will thin out your mucus, which could help prevent blocked sinuses.\n 3)Place a warm, wet towel on your face. It may relieve discomfort and open your nasal passages."],
         "context": ""
        },

        {"tag": "Cough",
         "patterns": ["How to cure cough?","How do you treat cough?", "what to do if i get a cough?", "Which medicine to take if I get cough?", "How do you get rid of cough?"],
         "responses": ["1) Honey:- Use honey to treat a cough, mix 2 teaspoons (tsp) with warm water or an herbal tea. Drink this mixture once or twice a day. Do not give honey to children under 1 year of age. \n2) Ginger:- Brew up a soothing ginger tea by adding 20–40 grams (g) of fresh ginger slices to a cup of hot water. Allow to steep for a few minutes before drinking. Add honey or lemon juice to improve the taste and further soothe a cough. \n3) Fluids:- Staying hydrated is vital for those with a cough or cold. Research indicates that drinking liquids at room temperature can alleviate a cough, runny nose, and sneezing."],
         "context": ""
        },

        {"tag": "Sore Throat",
         "patterns": ["How do you treat sore throat?", "what to do if i get a sore throat?", "Which medicine to take if I get a sore throat?", "How to cure sore throat?"],
         "responses": ["1) Make sure you get plenty of rest and drink a lot of fluids. \n2)Inhale steam: Run hot water in a sink. Drape a towel over you to trap the steam, and lean over the sink with the water running. Breathe deeply through your mouth and nose for 5 to 10 minutes. Repeat several times a day. \n3)Sip chicken broth or warm tea with honey. Don’t give honey to a child under 12 months of age."],
         "context": ""
        },

        {"tag": "Gastrointestinal problems",
         "patterns": ["How do you treat gas problems?", "what to do if i have Gastrointestinal problems?", "Which medicine to take if I get gas problem?", "How to cure Gas problems?"],
         "responses": ["1) Replenish body fluids \n2)Do not take antidiarrheal drugs or laxatives or pain medication, unless specified by a medical professional.\n3)Taking antacids may help, per recommendation of a healthcare professional. \n4)If prone to frequent heartburns, seek medical help. \n5)Taking meals that are not spicy regularly, can relieve ulcer pains.\n6)Seek medical help, if conditions persist or continue to worsen"],
         "context": ""
        },

        {"tag": "Skin problems",
         "patterns": ["How do you treat Skin problems?", "what to do if i get a skin allergy?", "Which medicine to take if I get a skin allergy?", "How to cure skin allergy?"],
         "responses": ["1)Hydrocortisone cream. \n2)Ointments like calamine lotion. \n3)Antihistamines. \n4)Cold compresses. \n5)Oatmeal baths. \n6)Talk to your doctor about what's best for your specific rash."],
         "context": ""
        },

        {"tag": "Abdominal Pain",
         "patterns": ["How do you treat Abdominal Pain?", "what to do if i get a Abdominal Pain?", "Which medicine to take if I get a Abdominal Pain?", "How to cure Abdominal Pain?"],
         "responses": ["1)Provide clear fluids to sip, such as water, broth, or fruit juice diluted with water. \n2)Serve bland foods, such as saltine crackers, plain bread, dry toast, rice, gelatin, or applesauce. \n3)Avoid spicy or greasy foods and caffeinated or carbonated drinks until 48 hours after all symptoms have gone away. "],
         "context": ""
        },

        {"tag": "Bruises",
         "patterns": ["How do you treat Bruises?", "what to do if i get a Bruise?", "Which medicine to take if I get a Bruise?", "How to cure Bruises?"],
         "responses": ["1)Ice the bruise with an ice pack wrapped in a towel. \n2)Leave it in place for 10 to 20 minutes. \n3)Repeat several times a day for a day or two as needed. \n4)Compress the bruised area if it is swelling, using an elastic bandage. "],
         "context": ""
        },

        {"tag": "Broken Toe",
         "patterns": ["How do you treat a Broken Toe?", "what to do if i get a Broken Toe?", "Which medicine to take if I get a Broken Toe?", "How to cure Broken Toe?"],
         "responses": ["1)To help decrease pain and swelling in a broken toe, elevate the foot, ice the injury, and stay off the foot. \n2)Depending on the severity of the fracture, the toe may need to be put back into place (reduced), and some compound toe fractures may require surgery.\n3) Most broken toes heal without complications in six weeks."],
         "context": ""
        },

        {"tag": "Choking",
         "patterns": ["How do you treat Choking?", "what to do if i get a Choke?", "Which medicine to take if I get Choked?", "How to cure Choking?"],
         "responses": ["1)Encourage them to keep coughing to try to clear the blockage. \n2)Ask them to try to spit out the object if it's in their mouth. \n3)If coughing doesn't work, start back blows and Abdonominal thrusts"],
         "context": ""
        },

        {"tag": "Wound",
         "patterns": ["How do you treat a wound?", "what to do if i get a Wound?", "Which medicine to take if I get wounded?", "How to cure a wound?"],
         "responses": ["1)Rinse the cut or wound with water and apply pressure with sterile gauze, a bandage, or a clean cloth. \n2)If blood soaks through the bandage, place another bandage on top of the first and keep applying pressure. \n3)Raise the injured body part to slow bleeding. \n4)When bleeding stops, cover the wound with a new, clean bandage."],
         "context": ""
        },

        {"tag": "Diarrhea",
         "patterns": ["How do you treat Diarrhea?", "what to do if i get Diarrhea?", "Which medicine to take if I get Diarrhea?", "How to cure Diarrhea?"],
         "responses": ["1)Hydrating the body is essential for recovering from diarrhea. This causes the body to lose electrolytes such as sodium and chloride. \n2)It is highly recommended to avoid dairy products, as they may worsen diarrhea in some people. \n3)However, if diarrhea lasts for more than 2 days, seek medical advice to avoid complications."],
         "context": ""
        },

        {"tag": "Frost bite",
         "patterns": ["How do you treat a Frost bite?", "what to do if i get a Frost bite?", "Which medicine to take if I get a Frost bite?", "How to cure Frost bite?"],
         "responses": ["1) Warm Gradually: Use warm water to slowly thaw the frostbitten area. \n2) Remove Wet Clothes: Take off wet or tight clothing to improve blood flow. \n3) No Rubbing: Avoid rubbing the affected area to prevent skin damage. \n4) Pain Relief: Use OTC pain relievers like ibuprofen. \n5) See a Doctor: Seek medical help for severe cases or large areas of frostbite."],
         "context": ""
        },

        {"tag": "Heat Exhaustion",
         "patterns": ["How do you treat Heat Exhaustion?", "what to do if i feel Exhausted due to heat?", "Which medicine to take if I get Exhausted?", "How to cure Heat Exhaustion?"],
         "responses": ["1. Hydrate: Drink water to rehydrate. \n2. Remove tight or unnecessary clothing. \n3. Move to a cool, shaded area and rest until symptoms subside."],
         "context": ""
        },

        {"tag": "Heat Stroke",
         "patterns": ["How do you treat Heat Stroke?", "what to do if i get a Heat Stroke?", "Which medicine to take if I get Stroke?", "How to cure a Heat Stroke?"],
         "responses": ["1) Emergency Response: Call for emergency medical help immediately. \n2) Cool Rapidly: Get the person to a cool, shaded area and use any available means to cool the person quickly (fan, cooling packs, cold compresses, or a cool bath).\n3) Hydrate:If conscious, offer sips of cool water. \n4) Loosen Clothing: Remove excess clothing to aid in cooling. \n5) Moniter: Keep a close eye on the person's condition and vital signs till professional help arrives."],
         "context": ""
        },

        {"tag": "nose bleed",
         "patterns": ["How do you treat a bleeding nose?", "what to do if i my nose is bleeding?", "Which medicine to take if I get nose bleed?", "How to cure nose bleeding?"],
         "responses": ["1. Sit the person up straight and drop their head slightly forward.\n2. Apply finger and thumb pressure on the soft part of nostrils below the bridge of the nose for at least 10 minutes.\n3. Encourage the person to breathe through their mouth while their nostrils are pinched.\n4. Loosen tight clothing around the neck.\n5. Place a cold cloth or cold pack over the person's forehead and one around the neck, especially around the sides of the neck.\n6. After 10 minutes, release the pressure on the nostrils and check to see if the bleeding has stopped.\nIf bleeding persist, seek medical aid."],
         "context": ""
        },

        {"tag": "Pulled Muscle",
         "patterns": ["How do you treat a Pulled Muscle?", "what to do if my muscle is pulled?", "Which medicine to take if I got pulled muscle?", "How to cure a pulled muscle?"],
         "responses": ["1. Sit the person up straight and drop their head slightly forward. Avoid tilting the head backwards to prevent the blood from flowing down the throat. \n2. Apply finger and thumb pressure on the soft part of nostrils below the bridge of the nose for at least 10 minutes.  Encourage the person to breathe through their mouth while their nostrils are pinched.\n3. Loosen tight clothing around the neck. 4. Place a cold cloth or cold pack over the person’s forehead and one around the neck, especially around the sides of the neck.\nIf bleeding persists for more than 20 minutes or is recurrent, seek medical attention.  "],
         "context": ""
        },

        {"tag": "Poison",
         "patterns": ["How do you treat a Poison?", "what to do if i get Poison?", "Which medicine to take if I am poisoned?", "How to cure Poisoning?"],
         "responses": ["First aid for poisoning can vary depending on the type of poison. Here are general steps to follow:\n1. Dial emergency services immediately.\n2. Keep the person calm, and try to stay calm yourself.\n3. Identify the Poison: Provide information about the substance ingested if known.\n4. Do Not Induce Vomiting:Avoid inducing vomiting unless instructed by emergency services or poison control.\n5.If the poison comes into contact with the eyes or skin, rinse with water for at least 15 minutes. If clothing is contaminated, remove it carefully and rinse the affected area with water.\n6. Keep the person comfortable and monitor their breathing, pulse, and consciousness till help arrives"],
         "context": ""
        },

        {"tag": "Teeth",
         "patterns": ["How do you treat broken Teeth ?", "what to do if my Teeth got broken?", "Which medicine to take if I get broken teeth?", "cure broken teeth?"],
         "responses": ["1. Put on gloves or use a barrier to protect yourself from any potential bloodborne pathogens. \n2. Handle the broken tooth by the crown (top part) and avoid touching the root.\n3.Rinse the tooth with milk or saline solution if it's dirty. Do not use water, and do not scrub or touch the root.\n4. If possible, gently place the tooth back into the socket and have the person bite down on gauze or a clean cloth.\n5. If repositioning is not possible, store the tooth in a container with milk or the person's saliva. Seek dental care immediately.\nRemember to seek professional dental care as soon as possible for proper treatment of a broken tooth."],
         "context": ""
        },

        {"tag": "seizure",
         "patterns": ["How do you treat a seizure?", "what to do if i get a seizure?", "Which medicine to take if I get seizure?", "How to cure seizure?"],
         "responses": ["1. Clear the area around the person to prevent injury. Remove any sharp objects or obstacles.\n2.  Gently turn the person onto their side to help clear the airway and allow any fluids to drain.\n3. Place a soft object or your hands under their head to prevent injury to the head.\n4. Loosen any tight clothing around the neck to facilitate easier breathing.\n5. Note the time the seizure starts and ends. If the seizure lasts longer than 5 minutes or if another seizure follows immediately, seek emergency medical help.\n6. Stay calm and reassure others. Seizures can be frightening, but most end on their own without causing harm.\n7. Do not attempt to restrain the person during the seizure. Allow the seizure to run its course. \n8.After the seizure ends, stay with the person and offer reassurance. They may be confused or tired."],
         "context": ""
        },

        {"tag": "Head Injury",
         "patterns": ["How do you treat a head Injury?", "what to do if i get a Head Injury?", "Which medicine to take if I get injured in the head?", "How to cure Head Injury?"],
         "responses": ["1. Ensure the safety of the environment to prevent further injury and keep the person calm and encourage them to remain still. Avoid unnecessary movements.\n2. If the head injury is severe, call for emergency medical assistance immediately.\n3. If there is bleeding, apply gentle pressure with a clean cloth or bandage to control the bleeding. Avoid pressing directly on the injury. \n4. If the person is conscious and not experiencing neck pain, elevate their head slightly to reduce swelling. \n\nHead injuries can be serious, and professional medical evaluation is crucial. If in doubt or if the person shows signs of severe injury, seek immediate medical attention."],
         "context": ""
        },

        {"tag": "Fainting",
         "patterns": ["How do you treat Faint?", "what to do if i feel like Fainting?", "Which medicine to take if I get a Faint?", "How to cure Fainting?"],
         "responses": ["1. Ensure the person is in a safe location, away from any immediate hazards. Clear the area to prevent injury. \n2. Lay the person down on their back. If not possible, have them sit with their head between their knees. \n3.  Loosen any tight clothing, especially around the neck, to promote better blood circulation. \n4. Apply a cool compress to the person's forehead to help revive them. Avoid using ice directly on the skin. \n5. Stay with the person and monitor their breathing. If the person is unconscious for more than a minute or if there are other concerning symptoms, such as chest pain or difficulty breathing, call for emergency medical assistance immediately."],
         "context": ""
        },



        {"tag": "Insect Bites",
         "patterns": ["How do you treat a Insect Bite?", "what to do if a insect bites me?", "Which medicine to take if I get bitten by a insect?", "How to cure insect bite?"],
         "responses": ["1. Wash the bite with soap and water. \n2. If there is a swelling, Use a cold compress to reduce swelling. \n3. Take an over-the-counter antihistamine for itching. \n4. Resist the urge to scratch to prevent infection. \n5. Watch for signs of severe allergic reactions and seek medical help if needed."],
         "context": ""
        },

        {"tag": "Headache",
         "patterns": ["How do you treat a mild Headache?", "what to do if i get a mild Headache?", "Which medicine to take if I have a mild headache?", "How to cure a mild headache?"],
         "responses": ["Give ibuprofen (Advil, Motrin), aspirin, or acetaminophen (Tylenol) for pain. \nCaution: Avoid ibuprofen and other NSAIDs if the person has heart failure or kidney failure. \nDo not give aspirin to a child under age 18."],
         "context": ""
        },

	{"tag": "Cold",
         "patterns": ["How do you treat a Cold?", "what to do if i get a mild Cold?", "Which medicine to take if I have a Cold?", "How to cure Cold?"],
         "responses": ["1)Keeping hydrated is absolutely vital to help 'flush' out the cold, as well as to break down congestion and keep your throat lubricated. \n2)Vitamin C is extremely helpful when fighting infection, so at the first sign of a cold be sure to increase your intake by eating plenty of berries, citrus fruits, papayas, broccoli and red peppers which will help keep you protected. \n3)When it comes to combating a cold,Vitamin D is essential in helping to regulate immune response."],
         "context": ""
        },
	
	{"tag": "Rash",
         "patterns": ["How do you treat Rashes?", "what to do if i get a Rash?", "Which medicine to take if I have a Rash?", "How to cure Rash?"],
         "responses": ["1)Olive oil helps in healing and promotes skin renewal given it is packed with vitamin E and antioxidants. It also soothes the skin and reduces itching. \n2)Baking soda is useful in drying skin rashes as also in relieving itching and inflammation. \n3)Aloe Vera,Thanks to its antibacterial, antifungal, anti-inflammatory and emollient properties, aloe vera is excellent for treating a number of skin ailments including rashes as also soothing the skin."],
         "context": ""
        },
	
	{"tag": "snake bite",
         "patterns": ["How do you treat a snake bite?", "what to do if i get a snake bite?", "Which medicine to take if I get a snake bite?", "How to cure snake bite?", "i got bit by a snake"],
         "responses": ["While waiting for medical help: \n1)Move the person beyond striking distance of the snake. \n2)Have the person lie down with wound below the heart. \n3)Keep the person calm and at rest, remaining as still as possible to keep venom from spreading. \n4)Cover the wound with loose, sterile bandage. \n5)Remove any jewelry from the area that was bitten. \n6)Remove shoes if the leg or foot was bitten."],
         "context": ""
        },

	{"tag": "animal bite",
         "patterns": ["How do you treat a animal bite?", "How do you treat a monkey bite?","How do you treat a dog bite?", "what to do if i get a animal bite?", "Which medicine to take if I get a monekey bite?", "How to cure dog bite?", "i got bit by a dog"],
         "responses": ["1)Wash the wound with soap and warm water. \n2)Gently press a clean cloth over the wound to stop the flow of blood. \n3)Apply an antibacterial ointment to the wound. \n4)Cover with a sterile bandage. \n5)Watch for signs of infection. \n6)Seek help if you suspect infection or possible exposure to rabies, or if the wound is severe."],
         "context": ""
        },

	{"tag": "Drowning",
         "patterns": ["What to do if someone is Drowning?", "what to do if someone drowned?", "What steps to take if i see a drowning person?", "How to help a drowning person?"],
         "responses": ["1)Place your ear next to the person's mouth and nose. Do you feel air on your cheek? \n2)Look to see if the person's chest is moving.If the Person is Not Breathing, Check Pulse.\n 3)Check the person's pulse for 10 seconds.If There is No Pulse, Start CPR."],
         "context": ""
        },

        {"tag": "CPR",
         "patterns": ["How to give CPR??", "what to do in a CPR?", "What steps to take in a CPR??", "How to help a drowning person in CPR?"],
         "responses": ["1)For an adult or child, place the heel of one hand on the center of the chest at the nipple line. You can also push with one hand on top of the other. For an infant, place two fingers on the breastbone. \n2)For an adult or child, press down at least 2 inches. Make sure not to press on ribs. For an infant, press down about 1 and 1/2 inches. Make sure not to press on the end of the breastbone. \n3)Do chest compressions only, at the rate of 100-120 per minute or more. Let the chest rise completely between pushes. \n4)Check to see if the person has started breathing."],
         "context": ""
        },

	{"tag": "Fracture",
         "patterns": ["How do you treat a Fracture?", "what to do if i get a Fracture?", "Which medicine to take if I have a Fracture?", "How to cure a Fracture?"],
         "responses": ["1)Stop any bleeding. Apply pressure to the wound with a sterile bandage, a clean cloth or a clean piece of clothing. \n2)Immobilize the injured area. Don't try to realign the bone or push a bone that's sticking out back in. If you've been trained in how to splint and professional help isn't readily available, apply a splint to the area above and below the fracture sites. Padding the splints can help reduce discomfort. \n3)Apply ice packs to limit swelling and help relieve pain. Don't apply ice directly to the skin. Wrap the ice in a towel, piece of cloth or some other material. \n4)Treat for shock. If the person feels faint or is breathing in short, rapid breaths, lay the person down with the head slightly lower than the trunk and, if possible, elevate the legs."],
         "context": ""
        },

        {"tag":"ending",
        "patterns": ["bye", "thank you", "see ya", "exit", "that's it"],
        "responses":["I hope it helped (^^)\nTake care!!"],
        "context":""
        }
   ]
}
